#+TITLE: Bitwarden Configuration
#+PROPERTY: header-args:emacs-lisp :tangle bitwarden.el :results none

*** Classic
#+begin_src emacs-lisp
(defcustom bitwarden-clients-classic-bit-build-cli "cd apps/cli && npm run build:bit"
  "Command to build the Bitwaren CLI locally with npm"
  :type 'string
  :group 'tools)
(setq bitwarden-clients-classic-bit-build-cli
      "cd apps/cli && npm run build:bit")

(defun bitwarden/cli-classic-build-bit ()
  "Select a project with Projectile and run `bitwarden-clients-classic-bit-build-cli` in it."
  (interactive)
  (my/projectile-run-command-in-selected-project bitwarden-clients-classic-bit-build-cli))
(add-to-list 'my/executer-picker-candidates
             '("bitwarden/clients: classic bit build cli" . bitwarden/cli-classic-build-bit))
#+end_src

#+RESULTS:
: ((bitwarden/clients: classic bit build cli . bitwarden/cli-classic-build-bit) (bitwarden/clients: npm ci . bitwarden/clients-npm-ci) (bitwarden/clients: nx bit build cli . bitwarden/cli-nx-build-bit) (bitwarden/clients: npm ci . bitwarden/cli-npm-ci) (bitwarden/clients: typechecker . bitwarden/clients-run-test-types) (nix: update flake . my/nix/flake-update) (nix: format . my/nix/format) (nix: rebuild . my/nix/rebuild))


